{
    "books": [
        {
            "_id": "62fb6512e40325c31d956aa5",
            "title": "Professional Node.js",
            "authors": ["Pedro Teixeira"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2012-10-01",
            "description": "Learn to build fast and scalable software in JavaScript with Node.js Node.js is a powerful and popular new framework for writing scalable network programs using JavaScript. This no nonsense book begins with an overview of Node.js and then quickly dives into the code, core concepts, and APIs. In-depth coverage pares down the essentials to cover debugging, unit testing, and flow control so that you can start building and testing your own modules right away. Covers node and asynchronous programming main concepts Addresses the basics: modules, buffers, events, and timers Explores streams, file systems, networking, and automated unit testing Goes beyond the basics, and shares techniques and tools for debugging, unit testing, and flow control If you already know JavaScript and are curious about the power of Node.js, then this is the ideal book for you.",
            "isbn": "9781118240564",
            "pageCount": 408,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=ZH6bpbcrlvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 21.99,
            "snippet": "Professional Node.js: Addresses querying, reading from, and writing to files Explores streams, file systems, networking, and automated unit testing Details how to read and write streams of data Zeroes-in on building TCP and HTTP servers and ...",
            "stars": 2,
            "reviews": 2,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa2",
            "title": "Node.js in Action",
            "authors": [
                "Tim Oxley",
                "Nathan Rajlich",
                "TJ Holowaychuk",
                "Alex Young"
            ],
            "publisher": "Simon and Schuster",
            "publishedDate": "2017-08-16",
            "description": "Summary Node.js in Action, Second Edition is a thoroughly revised book based on the best-selling first edition. It starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Technology You already know JavaScript. The trick to mastering Node.js is learning how to build applications that fully exploit its powerful asynchronous event handling and non-blocking I/O features. The Node server radically simplifies event-driven real-time apps like chat, games, and live data analytics, and with its incredibly rich ecosystem of modules, tools, and libraries, it's hard to beat! About the Book Based on the bestselling first edition, Node.js in Action, Second Edition is a completely new book. Packed with practical examples, it teaches you how to create high-performance web servers using JavaScript and Node. You'll master key design concepts such as asynchronous programming, state management, and event-driven programming. And you'll learn to put together MVC servers using Express and Connect, design web APIs, and set up the perfect production environment to build, lint, and test. What's Inside Mastering non-blocking I/O The Node event loop Testing and deploying Web application templating About the Reader Written for web developers with intermediate JavaScript skills. About the Authors The Second Edition author team includes Node masters Alex Young, Bradley Meck, Mike Cantelon, and Tim Oxley, along with original authors Marc Harter, T.J. Holowaychuk, and Nathan Rajlich. Table of contents PART 1 - WELCOME TO NODE Welcome to Node.js Node programming fundamentals What is a Node web application? PART 2 - WEB DEVELOPMENT WITH NODE Front-end build systems Server-side frameworks Connect and Express in depth Web application templating Storing application data Testing Node applications Deploying Node applications and maintaining uptime PART 3 - BEYOND WEB DEVELOPMENT Writing command-line applications Conquering the desktop with Electron",
            "isbn": "9781638355175",
            "pageCount": 392,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=yzgzEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 38.99,
            "snippet": "About the Book Based on the bestselling first edition, Node.js in Action, Second Edition is a completely new book. Packed with practical examples, it teaches you how to create high-performance web servers using JavaScript and Node.",
            "stars": 2.5,
            "reviews": 25,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aaa",
            "title": "Fullstack React",
            "authors": ["Accomazzo Anthony", "Murray Nathaniel", "Ari Lerner"],
            "publisher": "Fullstack.IO",
            "publishedDate": "2017-03",
            "description": "LEARN REACT TODAY The up-to-date, in-depth, complete guide to React and friends. Become a ReactJS expert today",
            "isbn": "0991344626",
            "pageCount": 836,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=ppjUtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 27.99,
            "snippet": "LEARN REACT TODAY The up-to-date, in-depth, complete guide to React and friends. Become a ReactJS expert today",
            "stars": 0.5,
            "reviews": 36,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aab",
            "title": "The Road to React",
            "authors": ["Robin Wieruch"],
            "publisher": "Robin Wieruch",
            "publishedDate": "2017-11-15",
            "description": "LAST UPDATE: 09. June 2021 If you are looking for a comprehensive and pragmatic yet concise and up-to-date React.js feat. Hooks book, the Road to React is for you. What you will learn. In \"The Road to React\" you will learn about all the fundamentals of React.js with Hooks while building a full-blown React application step by step. While you create the React application, every chapter will introduce you to a new React key feature. However, there is more than only the fundamentals: The book dives into related topics (e.g. React with TypeScript, Testing, Performance Optimizations) and advanced feature implementations like client- and server-side searching. At the end of the book, you will have a fully working deployed React application. Is it up to date? Programming books are usually outdated soon after their release, but since this book is self- published, I can update it as needed whenever a new version of something related to this book gets released. I am a beginner. Is this book for me? Yes. The book starts from zero and takes you through the learning experience step by step. Every chapter builds up on the learnings from the previous chapter. In addition, at the end of every chapter, exercises fortify your lessons learned. If you got stuck in a chapter, you will always find a reference URL to the status quo of the actual code. Core Concepts Pragmatic: Master React while building a complete application step by step. Problems Solving: You need to experience a problem first before solving it. The Why: Readers like how the book answers the Why, not only the How. Table of Contents Fundamentals of React Hello React Requirements Setting up a React Project Meet the React Component React JSX Lists in React Meet another React Component React Component Instantiation ReactDOM React Component Definition (Advanced) Handler Function in JSX React Props React State Callback Handlers in JSX Lifting State in React React Controlled Components Props Handling (Advanced) React Side-Effects React Custom Hooks (Advanced) React Fragments Reusable React Component React Component Composition Imperative React Inline Handler in JSX React Asynchronous Data React Conditional Rendering React Advanced State React Impossible States Data Fetching with React Data Re-Fetching in React Memoized Handler in React (Advanced) Explicit Data Fetching with React Third-Party Libraries in React Async/Await in React (Advanced) Forms in React React's Legacy React Class Components React Class Components: State Imperative React Styling in React CSS in React CSS Modules in React Styled Components in React SVGs in React React Maintenance Performance in React (Advanced) TypeScript in React Unit Testing to Integration Testing React Project Structure Real World React (Advanced) Sorting Reverse Sort Remember Last Searches Paginated Fetch Deploying a React Application Build Process Deploy to Firebase",
            "isbn": "9781720043997",
            "pageCount": 252,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=RRLmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 49.99,
            "snippet": "Programming books are usually outdated soon after their release, but since this book is self- published, I can update it as needed whenever a new version of something related to this book gets released. I am a beginner. Is this book for me?",
            "stars": 3.5,
            "reviews": 35,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aac",
            "title": "Learning React",
            "authors": ["Alex Banks", "Eve Porcello"],
            "publisher": "\"O'Reilly Media, Inc.\"",
            "publishedDate": "2020-06-12",
            "description": "If you want to learn how to build efficient React applications, this is your book. Ideal for web developers and software engineers who understand how JavaScript, CSS, and HTML work in the browser, this updated edition provides best practices and patterns for writing modern React code. No prior knowledge of React or functional JavaScript is necessary. With their learning road map, authors Alex Banks and Eve Porcello show you how to create UIs that can deftly display changes without page reloads on large-scale, data-driven websites. You’ll also discover how to work with functional programming and the latest ECMAScript features. Once you learn how to build React components with this hands-on guide, you’ll understand just how useful React can be in your organization. Understand key functional programming concepts with JavaScriptLook under the hood to learn how React runs in the browserCreate application presentation layers with React componentsManage data and reduce the time you spend debugging applicationsIncorporate React Hooks to manage state and fetch dataUse a routing solution for single-page application featuresLearn how to structure React applications with servers in mind",
            "isbn": "9781492051671",
            "pageCount": 310,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=tjjrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 50.99,
            "snippet": "If you want to learn how to build efficient React applications, this is your book.",
            "stars": 5,
            "reviews": 10,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aad",
            "title": "Learning React",
            "authors": ["Kirupa Chinnathambi"],
            "publisher": "Addison-Wesley Professional",
            "publishedDate": "2018-04-26",
            "description": "Learning React A hands-on guide to building web applications using React and Redux As far as new web frameworks and libraries go, React is quite the runaway success. It not only deals with the most common problems developers face when building complex apps, it throws in a few additional tricks that make building the visuals for such apps much, much easier. What React isn’t, though, is beginner-friendly and approachable. Until now. In Learning React , author Kirupa Chinnathambi brings his fresh, clear, and very personable writing style to help web developers new to React understand its fundamentals and how to use it to build really performant (and awesome) apps. The only book on the market that helps you get your first React app up and running in just minutes, Learning React is chock-full of colorful illustrations to help you visualize difficult concepts and practical step-by-step examples to show you how to apply what you learn. Build your first React app Create components to define parts of your UI Combine components into other components to build more complex UIs Use JSX to specify visuals without writing full-fledged JavaScript Deal with maintaining state Work with React’s way of styling content Make sense of the mysterious component lifecycle Build multi-page apps using routing and views Optimize your React workflow using tools such as Node, Babel, webpack, and others Use Redux to make managing your app data and state easy Contents at a Glance 1 Introducing React 2 Building Your First React App 3 Components in React 4 Styling in React 5 Creating Complex Components 6 Transferring Properties 7 Meet JSX... Again! 8 Dealing with State in React 9 Going from Data to UI in React 10 Events in React 11 The Component Lifecycle 12 Accessing DOM Elements in React 13 Setting Up Your React Dev Environment 14 Working with External Data in React 15 Building an Awesome Todo List App in React 16 Creating a Sliding Menu in React 17 Avoiding Unnecessary Renders in React 18 Creating a Single-Page App in React Using React Router 19 Introduction to Redux 20 Using Redux with React",
            "isbn": "9780134843575",
            "pageCount": 240,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=7KVYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 31.99,
            "snippet": "The only book on the market that helps you get your first React app up and running in just minutes, Learning React is chock-full of colorful illustrations to help you visualize difficult concepts and practical step-by-step examples to show ...",
            "stars": 2,
            "reviews": 6,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aae",
            "title": "Learning React",
            "authors": ["Alex Banks", "Eve Porcello"],
            "publisher": "\"O'Reilly Media, Inc.\"",
            "publishedDate": "2017-04-27",
            "description": "If you want to learn how to build efficient user interfaces with React, this is your book. Authors Alex Banks and Eve Porcello show you how to create UIs with this small JavaScript library that can deftly display data changes on large-scale, data-driven websites without page reloads. Along the way, you’ll learn how to work with functional programming and the latest ECMAScript features. Developed by Facebook, and used by companies including Netflix, Walmart, and The New York Times for large parts of their web interfaces, React is quickly growing in use. By learning how to build React components with this hands-on guide, you’ll fully understand how useful React can be in your organization. Learn key functional programming concepts with JavaScript Peek under the hood to understand how React runs in the browser Create application presentation layers by mounting and composing React components Use component trees to manage data and reduce the time you spend debugging applications Explore React’s component lifecycle and use it to load data and improve UI performance Use a routing solution for browser history, bookmarks, and other features of single-page applications Learn how to structure React applications with servers in mind",
            "isbn": "9781491954577",
            "pageCount": 350,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=pMTADgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 44.99,
            "snippet": "If you want to learn how to build efficient user interfaces with React, this is your book.",
            "stars": 2.5,
            "reviews": 30,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aaf",
            "title": "Pro React 16",
            "authors": ["Adam Freeman"],
            "publisher": "Apress",
            "publishedDate": "2019-03-19",
            "description": "Use the enormously popular React framework to build dynamic JavaScript applications that take advantage of the capabilities of modern browsers and devices. You will learn how React brings the power of strong architecture and responsive data to the client, providing the foundation for complex and rich user interfaces. Best-selling author Adam Freeman explains how to get the most from React. He begins by describing the React architecture and the benefits it offers and then shows you how to use React and its associated tools and libraries in your projects, starting from the nuts and bolts and building up to the most advanced and sophisticated features, going in-depth to give you the knowledge you need. Each topic is presented clearly and concisely. Chapters include common problems and how to avoid them. What You’ll Learn Gain a solid understanding of the React design Create rich and dynamic web app clients using React Create data stores using Redux Consume data using REST and GraphQLTest your React projects Who This Book Is For JavaScript developers who want to use React to create dynamic client-side applications",
            "isbn": "9781484244517",
            "pageCount": 745,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=SM2NDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 46.99,
            "snippet": "What You’ll Learn Gain a solid understanding of the React design Create rich and dynamic web app clients using React Create data stores using Redux Consume data using REST and GraphQLTest your React projects Who This Book Is For ...",
            "stars": 0.5,
            "reviews": 6,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab0",
            "title": "React: Up & Running",
            "authors": ["Stoyan Stefanov"],
            "publisher": "\"O'Reilly Media, Inc.\"",
            "publishedDate": "2016-07-14",
            "description": "Hit the ground running with React, the open-source technology from Facebook for building rich web applications fast. With this practical guide, Yahoo! web developer Stoyan Stefanov teaches you how to build components—React’s basic building blocks—and organize them into maintainable, large-scale apps. If you’re familiar with basic JavaScript syntax, you’re ready to get started. Once you understand how React works, you’ll build a complete custom Whinepad app that helps users rate wines and keep notes. You’ll quickly learn why some developers consider React the key to the web app development puzzle. Set up React and write your first \"Hello world\" web app Create and use custom React components alongside generic DOM components Build a data table component that lets you edit, sort, search, and export its contents Use the JSX syntax extension as an alternative to function calls Set up a lean, low-level build process that helps you focus on React Build a complete custom app that lets you store data on the client Use ESLint, Flow, and Jest tools to check and test your code as your app evolves Manage communication between components with Flux",
            "isbn": "9781491931776",
            "pageCount": 222,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=a_asDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 30.99,
            "snippet": "With this practical guide, Yahoo! web developer Stoyan Stefanov teaches you how to build components—React’s basic building blocks—and organize them into maintainable, large-scale apps.",
            "stars": 4,
            "reviews": 27,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab1",
            "title": "React 17 Design Patterns and Best Practices",
            "authors": ["Carlos Santana Roldan"],
            "publisher": "Packt Publishing Ltd",
            "publishedDate": "2021-05-17",
            "description": "React is an open-source JavaScript library that is used for building user interfaces or UI components. This React book is designed to take you through the most valuable design patterns in React, helping you learn how to apply design patterns and best practices in real-world scenarios.",
            "isbn": "9781800561762",
            "pageCount": 394,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=viIvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 33.99,
            "snippet": "Build scalable, maintainable, and powerful React web apps with design patterns and insightful best practices Key FeaturesMake the most of design patterns in React – including render props and controlled and uncontrolled inputsMaster React ...",
            "stars": 3,
            "reviews": 40,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab2",
            "title": "Introduction to React",
            "authors": ["Cory Gackenheimer"],
            "publisher": "Apress",
            "publishedDate": "2015-09-11",
            "description": "Introduction to React teaches you React, the JavaScript framework created by developers at Facebook, to solve the problem of building complex user interfaces in a consistent and maintainable way. React.js shrugs away common front-end conventions in an effort to make things more efficient - use Introduction to React to learn about this framework and more today. Get to know the React API and it’s specific JavaScript extension, JSX, which makes authoring React components easier and maintainable. You will also learn how to test your React applications and about the tools you can use while building. Once you understand these core concepts, you can build applications with React. This will help you cement the ideas and fundamentals of React and prepare you to utilize React in your own use case. What You'll Learn: How to use React to maintain complex user interfaces in an efficient way How to integrate existing user interfaces and move forward with React How to manage application architecture using Flux How to easily utilize JSX, React's JavaScript extension",
            "isbn": "9781484212455",
            "pageCount": 129,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=NZCKCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 41.99,
            "snippet": "Introduction to React teaches you React, the JavaScript framework created by developers at Facebook, to solve the problem of building complex user interfaces in a consistent and maintainable way.",
            "stars": 2.5,
            "reviews": 11,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa3",
            "title": "Node.js in Practice",
            "authors": ["Marc Harter", "Alex Young"],
            "publisher": "Simon and Schuster",
            "publishedDate": "2014-12-03",
            "description": "Summary Node.js in Practice is a collection of fully tested examples that offer solutions to the common and not-so-common issues you face when you roll out Node. You'll dig into important topics like the ins and outs of event-based programming, how and why to use closures, how to structure applications to take advantage of end-to-end JavaScript apps, and more. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Book You've decided to use Node.js for your next project and you need the skills to implement Node in production. It would be great to have Node experts Alex Young and Marc Harter at your side to help you tackle those day-to-day challenges. With this book, you can! Node.js in Practice is a collection of 115 thoroughly tested examples and instantly useful techniques guaranteed to make any Node application go more smoothly. Following a common-sense Problem/Solution format, these experience-fueled techniques cover important topics like event-based programming, streams, integrating external applications, and deployment. The abundantly annotated code makes the examples easy to follow, and techniques are organized into logical clusters, so it's a snap to find what you're looking for. Written for readers who have a practical knowledge of JavaScript and the basics of Node.js. What's Inside Common usage examples, from basic to advanced Designing and writing modules Testing and debugging Node apps Integrating Node into existing systems About the Authors Alex Young is a seasoned JavaScript developer who blogs regularly at DailyJS. Marc Harter works daily on large-scale projects including high-availability real-time applications, streaming interfaces, and other data-intensive systems. Table of Contents PART 1 NODE FUNDAMENTALS Getting started Globals: Node's environment Buffers: Working with bits, bytes, and encodings Events: Mastering EventEmitter and beyond Streams: Node's most powerful and misunderstood feature File system: Synchronous and asynchronous approaches Networking: Node's true \"Hello, World\" Child processes: Integrating external applications with Node PART 2 REAL-WORLD RECIPES The Web: Build leaner and meaner web applications Tests: The key to confident code Debugging: Designing for introspection and resolving issues Node in production: Deploying applications safely PART 3 WRITING MODULES Writing modules: Mastering what Node is all about",
            "isbn": "9781638355182",
            "pageCount": 424,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=rTgzEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 38.99,
            "snippet": "Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Book You&#39;ve decided to use Node.js for your next project and you need the skills to implement Node in production.",
            "stars": 4.5,
            "reviews": 2,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab4",
            "title": "Harry Potter and the Cursed Child",
            "authors": ["J. K. Rowling", "Jack Thorne", "John Tiffany"],
            "publisher": "Sphere",
            "publishedDate": "2017-07-25",
            "description": "The official playscript of the original West End production of Harry Potter and the Cursed Child. It was always difficult being Harry Potter and it isn't much easier now that he is an overworked employee of the Ministry of Magic, a husband, and father of three school-age children. While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places. The playscript for Harry Potter and the Cursed Child was originally released as a 'special rehearsal edition' alongside the opening of Jack Thorne's play in London's West End in summer 2016. Based on an original story by J.K. Rowling, John Tiffany and Jack Thorne, the play opened to rapturous reviews from theatregoers and critics alike, while the official playscript became an immediate global bestseller. This revised paperback edition updates the 'special rehearsal edition' with the conclusive and final dialogue from the play, which has subtly changed since its rehearsals, as well as a conversation piece between director John Tiffany and writer Jack Thorne, who share stories and insights about reading playscripts. This edition also includes useful background information including the Potter family tree and a timeline of events from the wizarding world prior to the beginning of Harry Potter and the Cursed Child.",
            "isbn": "0751565369",
            "pageCount": 352,
            "categories": ["Fiction"],
            "imageUrl": "http://books.google.com/books/content?id=kLAoswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 42.99,
            "snippet": "This edition includes the final dialogue and stage directions of the original, two-part play, a conversation piece between director John Tiffany and playwright Jack Thorne, the Potter family tree, and a timeline of key events in the ...",
            "stars": 0.5,
            "reviews": 33,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab5",
            "title": "Harry Potter Coloring Book",
            "authors": ["Inc. Scholastic"],
            "publisher": "Scholastic Incorporated",
            "publishedDate": "2015-11-10",
            "description": "Packed with stunning pieces of artwork from the Warner Bros. archive, this deluxe coloring book gives fans the chance to color in the vivid settings and beloved characters of J.K. Rowling's wizarding world. Containing intricate line drawings used in the making of the Harry Potter films, this coloring book includes fan-favorite scenes, creatures, and characters: from Dobby and baby Norbert to Quidditch games and the unforgettable final battle between Harry and Lord Voldemort. Unique and interactive, Harry Potter: The Official Coloring Book is a perfect collector's item for all fans of the blockbuster saga--whether it's for those who grew up with Harry, Ron, and Hermione, or those who are discovering the magic for the very first time.",
            "isbn": "1338029991",
            "pageCount": 96,
            "categories": ["Juvenile Fiction"],
            "imageUrl": "http://books.google.com/books/content?id=lMM4jgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 42.99,
            "snippet": "Filled with intricate illustrations and elaborate designs used in the making of the Harry Potter films, this book invites you to imbue the wizarding world with color in your own explorations of Hogwarts Castle, the Forbidden Forest, and ...",
            "stars": 3,
            "reviews": 33,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa4",
            "title": "Smashing Node.js",
            "authors": ["Guillermo Rauch"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2012-08-14",
            "isbn": "9781119963103",
            "pageCount": 320,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=G1y_5kpmatUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 35.99,
            "snippet": "Teaching you the essentials to making event-driven server-side apps, this book demonstrates how you can use less space and take less time for communication between web client and server.",
            "stars": 3,
            "reviews": 4,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab7",
            "title": "Fantastic Beasts and Where to Find Them: Cinematic Guide: Newt Scamander Do Not Feed Out",
            "authors": ["Felicity Baker"],
            "publishedDate": "2017-02-02",
            "description": "The essential film companion for Newt Scamander! Relive the magic of Newt's world with this hardback guidebook featuring your favourite scenes and quotes from Fantastic Beasts and Where to Find Them.",
            "isbn": "1407179403",
            "pageCount": 64,
            "categories": [],
            "imageUrl": "http://books.google.com/books/content?id=eq9XvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 36.99,
            "snippet": "Relive all the magic of Newt&#39;s world with this hardback guidebook featuring all you need to know about Newt from the movie.",
            "stars": 4,
            "reviews": 17,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa6",
            "title": "Get Programming with Node.js",
            "authors": ["Jonathan Wexler"],
            "publisher": "Simon and Schuster",
            "publishedDate": "2019-02-11",
            "description": "Summary Get Programming with Node.js teaches you to build web servers using JavaScript and Node. In this engaging tutorial, you'll work through eight complete projects, from writing the code for your first web server to adding live chat to a web app. Your hands will stay on the keyboard as you explore the most important aspects of the Node development process, including security, database management, authenticating user accounts, and deploying to production. You'll especially appreciate the easy-to-follow discussions, illuminating diagrams, and carefully explained code! Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Technology Node.js delivers the speed and reliability you need for ecommerce, social media, and gaming applications. It comes with thousands of prebuilt packages to help you get started immediately. If you want to use JavaScript on the server, Node.js is your choice. What's inside New features from ES2015 and later Writing asynchronous code Creating data models Debugging JavaScript modules About the Reader Written for front-end web developers with intermediate JavaScript skills. Table of Contents GETTING SET UP Lesson 0 - Setting up Node.js and the JavaScript engine Lesson 1 - Configuring your environment Lesson 2 - Running a Node.js application UNIT 1 - GETTING STARTED WITH NODE.JS Lesson 3 - Creating a Node.js module Lesson 4 - Building a simple web server in Node.js Lesson 5 - Handling incoming data Lesson 6 - Writing better routes and serving external files Lesson 7 - Capstone: Creating your first web application UNIT 2 - EASIER WEB DEVELOPMENT WITH EXPRESS.JS Lesson 8 - Setting up an app with Express.js Lesson 9 - Routing in Express.js Lesson 10 - Connecting views with templates Lesson 11 - Configurations and error handling Lesson 12 - Capstone: Enhancing the Confetti Cuisine site with Express.js UNIT 3 - CONNECTING TO A DATABASE Lesson 13 - Setting up a MongoDB database Lssson 14 - Building models with Mongoose Lesson 15 - Connecting controllers and models Using promises with Mongoose Lesson 16 - Capstone: Saving user subscriptions UNIT 4 - BUILDING A USER MODEL Lesson 17 - Improving your data models Lesson 18 - Building the user model Lesson 19 - Creating and reading your models Lesson 20 - Updating and deleting your models Lesson 21 - Capstone: Adding CRUD models to Confetti Cuisine Creating controllers UNIT 5 - AUTHENTICATING USER ACCOUNTS Lesson 22 - Adding sessions and flash messages Lesson 23 - Building a user login and hashing passwords Lesson 24 - Adding user authentication Lesson 25 - Capstone: Adding user authentication to Confetti Cuisine UNIT 6 - BUILDING AN API Lesson 26 - Adding an API to your application Lesson 27 - Accessing your API from your application Lesson 28 - Adding API security Lesson 29 - Capstone: Implementing an API UNIT 7 - ADDING CHAT FUNCTIONALITY Lesson 30 - Working with Socket.io Lesson 31 - Saving chat messages Lesson 32 - Adding a chat notification indicator UNIT 8 - DEPLOYING AND MANAGING CODE IN PRODUCTION Lesson 33 - Capstone: Adding a chat feature to Confetti Cuisine Lesson 34 - Deploying your application Lesson 35 - Managing in production Lesson 36 - Testing your application Lesson 37 - Capstone: Deploying Confetti Cuisine",
            "isbn": "9781638352402",
            "pageCount": 480,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=TTozEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 38.99,
            "snippet": "You&#39;ll especially appreciate the easy-to-follow discussions, illuminating diagrams, and carefully explained code! Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
            "stars": 2.5,
            "reviews": 28,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab9",
            "title": "Harry Potter and the Deathly Hallows",
            "authors": ["J. K. Rowling"],
            "publisher": "Arthur a Levine",
            "publishedDate": "2007",
            "description": "The seventh and final book of the blockbuster Harry Potter series follows the wizard's last year at Hogwarts School of Witchcraft and Wizardry. 12,000,000 first printing.",
            "isbn": "UOM:39076002651854",
            "pageCount": 870,
            "categories": ["Juvenile Fiction"],
            "imageUrl": "http://books.google.com/books/content?id=JHEkAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 43.99,
            "snippet": "The seventh and final book of the blockbuster Harry Potter series follows the wizard&#39;s last year at Hogwarts School of Witchcraft and Wizardry. 12,000,000 first printing.",
            "stars": 4.5,
            "reviews": 15,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aba",
            "title": "Teaching with Harry Potter",
            "authors": ["Valerie Estelle Frankel"],
            "publisher": "McFarland",
            "publishedDate": "2013-02-21",
            "description": "The Harry Potter phenomenon created a surge in reading with a lasting effect on all areas of culture, especially education. Today, teachers across the world are harnessing the power of the series to teach history, gender studies, chemistry, religion, philosophy, sociology, architecture, Latin, medieval studies, astronomy, SAT skills, and much more. These essays discuss the diverse educational possibilities of J.K. Rowling's books. Teachers of younger students use Harry and Hermione to encourage kids with disabilities or show girls the power of being brainy scientists. Students are reading fanfiction, splicing video clips, or exploring Rowling's new website, Pottermore. Harry Potter continues to open new doors to learning.",
            "isbn": "9780786472017",
            "pageCount": 288,
            "categories": ["Literary Criticism"],
            "imageUrl": "http://books.google.com/books/content?id=Wy-Kxu3A7x8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 26.99,
            "snippet": "These essays discuss the diverse educational possibilities of J.K. Rowling&#39;s books. Teachers of younger students use Harry and Hermione to encourage kids with disabilities or show girls the power of being brainy scientists.",
            "stars": 2.5,
            "reviews": 27,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956abb",
            "title": "Harry Potter and the Philosopher's Stone",
            "authors": ["J. K. Rowling"],
            "publisher": "Bloomsbury Publishing",
            "publishedDate": "2014-01-09",
            "description": "Celebrate 20 years of Harry Potter magic! Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...",
            "isbn": "9781408855898",
            "pageCount": 352,
            "categories": ["Juvenile Fiction"],
            "imageUrl": "http://books.google.com/books/content?id=HksgDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 31.99,
            "snippet": "An incredible adventure is about to begin!These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry ...",
            "stars": 4,
            "reviews": 19,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa7",
            "title": "Mastering Node.js",
            "authors": ["Sandro Pasquali"],
            "publisher": "Packt Pub Limited",
            "publishedDate": "2013-09",
            "description": "This book contains an extensive set of practical examples and an easy-to-follow approach to creating 3D objects.This book is great for anyone who already knows JavaScript and who wants to start creating 3D graphics that run in any browser. You don't need to know anything about advanced math or WebGL; all that is needed is a general knowledge of JavaScript and HTML. The required materials and examples can be freely downloaded and all tools used in this book are open source.",
            "isbn": "1782166327",
            "pageCount": 346,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=2e_sngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 35.99,
            "snippet": "This book contains an extensive set of practical examples and an easy-to-follow approach to creating 3D objects.This book is great for anyone who already knows JavaScript and who wants to start creating 3D graphics that run in any browser.",
            "stars": 2,
            "reviews": 10,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956abe",
            "title": "Effective JavaScript",
            "authors": ["David Herman"],
            "publisher": "Pearson Education",
            "publishedDate": "2013",
            "description": "Provides information on how to write better JavaScript programs, covering such topics as functions, arrays, library and API design, and concurrency.",
            "isbn": "9780321812186",
            "pageCount": 206,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=Nz9iAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 25.99,
            "snippet": "Provides information on how to write better JavaScript programs, covering such topics as functions, arrays, library and API design, and concurrency.",
            "stars": 3.5,
            "reviews": 6,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956abc",
            "title": "Harry Potter: The Wand Collection (Book)",
            "authors": ["Monique Peterson"],
            "publisher": "Insight Editions",
            "publishedDate": "2017-11-14",
            "description": "Discover the wands of your favorite Harry Potter characters. In the Harry Potter films, each wand is as unique as the witch or wizard who wields it. From Hermione Granger’s elegant, vine-wrapped wand to the bone-inlaid wands of the Death Eaters, each was designed and crafted by the filmmakers to reflect its owner’s identity. Harry Potter: The Wand Collection is a visual guide to these magical wands, their makers, and the characters who mastered them. Profiles of each wand feature stunning new photography of the original props, wand statistics, insights from the cast and crew, and other filmmaking secrets from the Warner Bros. archive. This collectible volume is an ideal resource for both wand-wielding veteran fans seeking to learn the history behind these beloved items and a new generation just beginning their journey into the wizarding world.",
            "isbn": "9781683831884",
            "pageCount": 154,
            "categories": ["Performing Arts"],
            "imageUrl": "http://books.google.com/books/content?id=968eEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 49.99,
            "snippet": "This collectible volume is an ideal resource for both wand-wielding veteran fans seeking to learn the history behind these beloved items and a new generation just beginning their journey into the wizarding world.",
            "stars": 2.5,
            "reviews": 2,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956abf",
            "title": "JavaScript for Kids",
            "authors": ["Nick Morgan"],
            "publisher": "No Starch Press",
            "publishedDate": "2014-12-14",
            "description": "JavaScript is the programming language of the Internet, the secret sauce that makes the Web awesome, your favorite sites interactive, and online games fun! JavaScript for Kids is a lighthearted introduction that teaches programming essentials through patient, step-by-step examples paired with funny illustrations. You’ll begin with the basics, like working with strings, arrays, and loops, and then move on to more advanced topics, like building interactivity with jQuery and drawing graphics with Canvas. Along the way, you’ll write games such as Find the Buried Treasure, Hangman, and Snake. You’ll also learn how to: –Create functions to organize and reuse your code –Write and modify HTML to create dynamic web pages –Use the DOM and jQuery to make your web pages react to user input –Use the Canvas element to draw and animate graphics –Program real user-controlled games with collision detection and score keeping With visual examples like bouncing balls, animated bees, and racing cars, you can really see what you’re programming. Each chapter builds on the last, and programming challenges at the end of each chapter will stretch your brain and inspire your own amazing programs. Make something cool with JavaScript today! Ages 10+ (and their parents!)",
            "isbn": "9781593274085",
            "pageCount": 336,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=71nDBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 32.99,
            "snippet": "JavaScript for Kids is a lighthearted introduction that teaches programming essentials through patient, step-by-step examples paired with funny illustrations.",
            "stars": 2.5,
            "reviews": 2,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac0",
            "title": "Eloquent JavaScript, 3rd Edition",
            "authors": ["Marijn Haverbeke"],
            "publisher": "No Starch Press",
            "publishedDate": "2018-12-04",
            "description": "Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track. As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. You start by learning the basic structure of the JavaScript language as well as control structures, functions, and data structures to help you write basic programs. Then you'll learn about error handling and bug fixing, modularity, and asynchronous programming before moving on to web browsers and how JavaScript is used to program them. As you build projects such as an artificial life simulation, a simple programming language, and a paint program, you'll learn how to: - Understand the essential elements of programming, including syntax, control, and data - Organize and clarify your code with object-oriented and functional programming techniques - Script the browser and make basic web applications - Use the DOM effectively to interact with browsers - Harness Node.js to build servers and utilities Isn't it time you became fluent in the language of the Web? * All source code is available online in an inter¬active sandbox, where you can edit the code, run it, and see its output instantly.",
            "isbn": "9781593279509",
            "pageCount": 472,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=p1v6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 35.99,
            "snippet": "As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs.",
            "stars": 3.5,
            "reviews": 19,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa8",
            "title": "Web Development with MongoDB and NodeJS",
            "authors": [
                "Mithun Satheesh",
                "Bruno Joseph D'mello",
                "Jason Krol"
            ],
            "publisher": "Packt Publishing Ltd",
            "publishedDate": "2015-10-30",
            "description": "Build an interactive and full-featured web application from scratch using Node.js and MongoDB About This Book Configure your development environment to use Node.js and MongoDB Use Node.js to connect to a MongoDB database and perform data manipulations A practical guide with clear instructions to design and develop a complete web application from start to finish Who This Book Is For This book is designed for JavaScript developers of any skill level that want to get up and running using Node.js and MongoDB to build full-featured web applications. A basic understanding of JavaScript and HTML is the only requirement for this book. What You Will Learn Configure your development environment to use Node.js and MongoDB Write and configure a web server using Node.js powered by the Express.js framework Build dynamic HTML pages using the Handlebars template engine Persist application data using MongoDB and Mongoose ODM Test your code using automated testing tools such as the Mocha framework Deploy the development environment to the cloud using services such as Heroku, Amazon Web Services, and Microsoft Azure Explore Single-Page application frameworks to take your web applications to the next level In Detail Node.js and MongoDB are quickly becoming one of the most popular tech stacks for the web. Powered by Google's V8 engine, Node.js caters to easily building fast, scalable network applications while MongoDB is the perfect fit as a scalable, high-performance, open source NoSQL database solution. Using these two technologies together, web applications can be built quickly and easily and deployed to the cloud with very little difficulty. The book will begin by introducing you to the groundwork needed to set up the development environment. Here, you will quickly run through the steps necessary to get the main application server up and running. Then you will see how to use Node.js to connect to a MongoDB database and perform data manipulations. From here on, the book will take you through integration with third-party tools for interaction with web apps. It then moves on to show you how to use controllers and view models to generate reusable code that will reduce development time. Toward the end of the book, we will cover tests to properly execute the code and some popular frameworks for developing web applications. By the end of the book, you will have a running web application developed with MongoDB and Node.js along with it's popular frameworks. Style and approach An easy guide to Node.js and MongoDB, which will quickly introduce you to the relevant concepts by taking you through the different steps involved in building a full-fledged web application.",
            "isbn": "9781785287459",
            "pageCount": 300,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=4QKACwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 33.99,
            "snippet": "With the introduction of <b>Node.js</b>, JavaScript has officially gone in a direction that was never even possible before. Now you can use JavaScript on the server and you can also use it to develop full-scale, enterprise-level applications.",
            "stars": 0.5,
            "reviews": 39,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aa9",
            "title": "Practical Node.js",
            "authors": ["Azat Mardan"],
            "publisher": "Apress",
            "publishedDate": "2018-08-17",
            "description": "Learn how to build a wide range of scalable real-world web applications using a professional development toolkit. If you already know the basics of Node.js, now is the time to discover how to bring it to production level by leveraging its vast ecosystem of packages.With this book, you'll work with a varied collection of standards and frameworks and see how all those pieces fit together. Practical Node.js takes you from installing all the necessary modules to writing full-stack web applications. You'll harness the power of the Express.js and Hapi frameworks, the MongoDB database with Mongoskin and Mongoose. You'll also work with Pug and Handlebars template engines, Stylus and LESS CSS lanaguages, OAuth and Everyauth libraries, and the Socket.IO and Derby libraries, and everything in between. This exciting second edition is fully updated for ES6/ES2015 and also covers how to deploy to Heroku and AWS, daemonize apps, and write REST APIs. You'll build full-stack real-world Node.js apps from scratch, and also discover how to write your own Node.js modules and publish them on NPM. You already know what Node.js is; now learn what you can do with it and how far you can take it! What You'll Learn Manipulate data from the mongo console Use the Mongoskin and Mongoose MongoDB libraries Build REST API servers with Express and Hapi Deploy apps to Heroku and AWS Test services with Mocha, Expect and TravisCI Utilize sessions for authentication Implement a third-party OAuth strategy with Everyauth Apply Redis, domains, WebSockets, and clusters Write your own Node.js module, and publish it on NPM Who This Book Is For Web developers who have some familiarity with the basics of Node.js and want to learn how to use it to build apps in a professional environment.",
            "isbn": "9781484230398",
            "pageCount": 505,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=fQJ2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 28.99,
            "snippet": "If you already know the basics of Node.js, now is the time to discover how to bring it to production level by leveraging its vast ecosystem of packages.With this book, you&#39;ll work with a varied collection of standards and frameworks and see ...",
            "stars": 2,
            "reviews": 26,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac3",
            "title": "JavaScript",
            "authors": ["T. J. Crowder"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2020-07-28",
            "description": "All of JavaScript's newest features, in depth, made easy to understand. JavaScript is a rapidly changing language and it can be challenging to keep up with all the new toys being added. JavaScript: The New Toys explores the newest features of the world's most popular programming language while also showing readers how to track what's coming next. After setting the stage by covering who manages the process of improving JavaScript, how new features get introduced, terminology, and a high-level overview of new features, it details each new or updated item in depth, with example uses, possible pitfalls, and expert recommendations for updating old habits in light of new features. JavaScript: The New Toys: Covers all the additions to JavaScript in ES2015-ES2019 plus a preview of ES2020 (and beyond) Explores the latest syntax: nullish coalescing, optional chaining, let and const, class syntax, private methods, private fields, new.target, numeric separators, BigInt, destructuring, default parameters, arrow functions, async functions, await, generator functions, ... (rest and spread), template literals, binary and octal literals, ** (exponentiation), computed property/method names, for-of, for-await-of, shorthand properties, and others Details the new features and patterns including modules, promises, iteration, generators, Symbol, Proxy, reflection, typed arrays, Atomics, shared memory, WeakMap, WeakSet, and more Highlights common pitfalls and explains how to avoid them Shows how to follow the improvements process and even participate in the process yourself Explains how to use new features even before they're widely supported With its comprehensive coverage and friendly, accessible style, JavaScript: The New Toys provides an invaluable resource for programmers everywhere, whether they work in web development, Node.js, Electron, Windows Universal Apps, or another JavaScript environment.",
            "isbn": "9781119367956",
            "pageCount": 260,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=-i3rDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 23.99,
            "snippet": "This book explores the newest features of the world&#39;s most popular programming language while also showing readers how to track what&#39;s coming next.",
            "stars": 2,
            "reviews": 41,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac4",
            "title": "Speaking JavaScript",
            "authors": ["Axel Rauschmayer"],
            "publisher": "\"O'Reilly Media, Inc.\"",
            "publishedDate": "2014-02-25",
            "description": "Like it or not, JavaScript is everywhere these days—from browser to server to mobile—and now you, too, need to learn the language or dive deeper than you have. This concise book guides you into and through JavaScript, written by a veteran programmer who once found himself in the same position. Speaking JavaScript helps you approach the language with four standalone sections. First, a quick-start guide teaches you just enough of the language to help you be productive right away. More experienced JavaScript programmers will find a complete and easy-to-read reference that covers each language feature in depth. Complete contents include: JavaScript quick start: Familiar with object-oriented programming? This part helps you learn JavaScript quickly and properly. JavaScript in depth: Learn details of ECMAScript 5, from syntax, variables, functions, and object-oriented programming to regular expressions and JSON with lots of examples. Pick a topic and jump in. Background: Understand JavaScript’s history and its relationship with other programming languages. Tips, tools, and libraries: Survey existing style guides, best practices, advanced techniques, module systems, package managers, build tools, and learning resources.",
            "isbn": "9781449364991",
            "pageCount": 460,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=qU3rAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 42.99,
            "snippet": "This concise book guides you into and through JavaScript, written by a veteran programmer who once found himself in the same position. Speaking JavaScript helps you approach the language with four standalone sections.",
            "stars": 0.5,
            "reviews": 36,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac5",
            "title": "JavaScript by Example",
            "authors": ["Ellie Quigley"],
            "publisher": "Prentice Hall Professional",
            "publishedDate": "2004",
            "description": "This is the definitive JavaScript tutorial for the serious nonprogrammer who is interested in mastering the full power of the language. Includes hundreds of example JavaScript programs that demonstrate both the fun and practical aspects.",
            "isbn": "0131401629",
            "pageCount": 730,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=IAJv2N1n9JAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 38.99,
            "snippet": "This is the definitive JavaScript tutorial for the serious nonprogrammer who is interested in mastering the full power of the language. Includes hundreds of example JavaScript programs that demonstrate both the fun and practical aspects.",
            "stars": 0.5,
            "reviews": 21,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac6",
            "title": "HTML and CSS",
            "authors": ["Jon Duckett"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2011-11-08",
            "description": "A full-color introduction to the basics of HTML and CSS from the publishers of Wrox! Every day, more and more people want to learn some HTML and CSS. Joining the professional web designers and programmers are new audiences who need to know a little bit of code at work (update a content management system or e-commerce store) and those who want to make their personal blogs more attractive. Many books teaching HTML and CSS are dry and only written for those who want to become programmers, which is why this book takes an entirely new approach. Introduces HTML and CSS in a way that makes them accessible to everyone—hobbyists, students, and professionals—and it’s full-color throughout Utilizes information graphics and lifestyle photography to explain the topics in a simple way that is engaging Boasts a unique structure that allows you to progress through the chapters from beginning to end or just dip into topics of particular interest at your leisure This educational book is one that you will enjoy picking up, reading, then referring back to. It will make you wish other technical topics were presented in such a simple, attractive and engaging way! This book is also available as part of a set in hardcover - Web Design with HTML, CSS, JavaScript and jQuery, 9781119038634; and in softcover - Web Design with HTML, CSS, JavaScript and jQuery, 9781118907443.",
            "isbn": "9781118008188",
            "pageCount": 512,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=aGjaBTbT0o0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 34.99,
            "snippet": "Many books teaching HTML and CSS are dry and only written for those who want to become programmers, which is why this book takes an entirely new approach.",
            "stars": 1.5,
            "reviews": 25,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac7",
            "title": "Head First HTML and CSS",
            "authors": ["Elisabeth Robson", "Eric Freeman"],
            "publisher": "\"O'Reilly Media, Inc.\"",
            "publishedDate": "2012",
            "description": "Presents information on creating Web pages using HTML and CSS.",
            "isbn": "9780596159900",
            "pageCount": 723,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=BZIYQtV6yKsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 37.99,
            "snippet": "Presents information on creating Web pages using HTML and CSS.",
            "stars": 1,
            "reviews": 19,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac8",
            "title": "Learn to Code HTML and CSS",
            "authors": ["Shay Howe"],
            "publisher": "New Riders",
            "publishedDate": "2014-04-22",
            "description": "HTML and CSS can be a little daunting at first but fear not. This book, based on Shay Howe's popular workshop covers the basics and breaks down the barrier to entry, showing readers how they can start using HTML and CSS through practical techniques today. They'll find accompanying code examples online, while they explore topics such as the different structures of HTML and CSS, and common terms. After establishing a basic understanding of HTML and CSS a deeper dive is taken into the box model and how to work with floats. The book includes an exercise focused on cleaning up a web page by improving the user interface and design, solely using HTML and CSS. With a few quick changes the web page changes shape and comes to life. Interactive, technically up-to-the-minute and easy-to-understand, this book will advance a student's skills to a professional level.",
            "isbn": "9780133477573",
            "pageCount": 304,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=PNFpAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 10.83,
            "snippet": "This book, based on Shay Howe&#39;s popular workshop covers the basics and breaks down the barrier to entry, showing readers how they can start using HTML and CSS through practical techniques today.",
            "stars": 1,
            "reviews": 27,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956aca",
            "title": "Beginning HTML and CSS",
            "authors": ["Rob Larsen"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2013-03-11",
            "description": "Everything you need to build websites with the newest versions of HTML and CSS If you develop websites, you know that the goal posts keep moving, especially now that your website must work on not only traditional desktops, but also on an ever-changing range of smartphones and tablets. This step-by-step book efficiently guides you through the thicket. Teaching you the very latest best practices and techniques, this practical reference walks you through how to use HTML5 and CSS3 to develop attractive, modern websites for today's multiple devices. From handling text, forms, and video, to implementing powerful JavaScript functionality, this book covers it all. Serves as the ultimate beginners guide for anyone who wants to build websites with HTML5 and CSS3, whether as a hobbyist or aspiring professional developer Covers the basics, including the different versions of HTML and CSS and how modern websites use structure and semantics to describe their contents Explains core processes, such as marking up text, images, lists, tables, forms, audio, and video Delves into CSS3, teaching you how to control or change the way your pages look and offer tips on how to create attractive designs Explores the jQuery library and how to implement powerful JavaScript features, such as tabbed content, image carousels, and more Get up to speed on HTML5, CSS3, and today's website design with this practical guide. Then, keep it on your desk as a reference!",
            "isbn": "9781118340189",
            "pageCount": 672,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=Yf_8CAL50SoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 22.99,
            "snippet": "Beginning HTML and CSS: Covers different versions of HTML and CSS, including the latest: HTML5 and CSS3 Gets you started programming with JavaScript® and explains how to implement JavaScript features, such as tabbed content, form ...",
            "stars": 3,
            "reviews": 22,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956acc",
            "title": "HTML, CSS, and JavaScript All in One",
            "authors": ["Julie C. Meloni", "Jennifer Kyrnin"],
            "publisher": "Sams Publishing",
            "publishedDate": "2018-12-04",
            "description": "Teach Yourself HTML, CSS, and JavaScript All in One combines these three fundamental web development technologies into one clearly written, carefully organized, step-by-step tutorial that expertly guides the beginner through these three interconnected technologies. In just a short time, you can learn how to use HTML, Cascading Style Sheets (CSS), and JavaScript together to design, create, and maintain world-class websites. Each lesson in this book builds on the previous ones, enabling you to learn the essentials from the ground up. Clear instructions and practical, hands-on examples show you how to use HTML to create the framework of your website, design your site’s layout and typography with CSS, and then add interactivity with JavaScript and jQuery. Step-by-step instructions carefully walk you through the most common web development tasks. Practical, hands-on examples show you how to apply what you learn. Quizzes and exercises help you test your knowledge and stretch your skills. Learn how to… Build your own web page and get it online in an instant Format text for maximum clarity and readability Create links to other pages and to other sites Add graphics, color, and visual pizzazz to your web pages Work with transparent images and background graphics Design your site’s layout and typography using CSS Make elements move on your page with CSS transformations and transitions Animate with CSS and the HTML5 Canvas element Write HTML that’s responsive web design-ready Design a site for mobile devices Use CSS media queries and breakpoints Get user input with web-based forms Use JavaScript to build dynamic, interactive web pages Add AJAX effects to your web pages Leverage JavaScript libraries such as jQuery Make your site easy to maintain and update as it grows",
            "isbn": "9780135167076",
            "pageCount": 99998,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=vF1-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 23.99,
            "snippet": "Each lesson in this book builds on the previous ones, enabling you to learn the essentials from the ground up.",
            "stars": 3,
            "reviews": 7,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac9",
            "title": "Learning Web Design",
            "authors": ["Jennifer Niederst Robbins"],
            "publisher": "\"O'Reilly Media, Inc.\"",
            "publishedDate": "2012-08-14",
            "description": "A guide to Web design basics describes how the Web and Web pages work, building HTML pages, using CSS for presentation, using JavaScript in Web design, and creating Web graphics.",
            "isbn": "9781449319274",
            "pageCount": 603,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=FJkVxtXr7n0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 22.99,
            "snippet": "A guide to Web design basics describes how the Web and Web pages work, building HTML pages, using CSS for presentation, using JavaScript in Web design, and creating Web graphics.",
            "stars": 2.5,
            "reviews": 0,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956acb",
            "title": "HTML, XHTML & CSS For Dummies",
            "authors": ["Ed Tittel", "Jeff Noble"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2010-12-20",
            "description": "What the book covers: the key features of HTML including getting to know (X)HTML and CSS, creating and viewing a Web page, planning your site, creating (X)HTML document structure, working with text and lists, creating and customizing links, finding and using images, using cascading style sheets (CSS), getting creative with colors and fonts, integrating scripts with (X)HTML, understanding deprecated HTML markup tags, working with content management systems (WordPress, Drupal, and Joomla), designing for mobile devices (iPhone, BlackBerry, and Android), getting started with HTML5 and CSS3, and much more. Updated coverage: the seventh edition will have approximately 50% new content and will be thoroughly revised to cover the latest concepts, tools, and trends in the industry. Series features: Information presented in the straightforward but fun language that has defined the Dummies series for more than nineteen years.",
            "isbn": "9780470916599",
            "pageCount": 416,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=EGp9DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 26.99,
            "snippet": "Illustrated in full color, this book provides beginner and advanced coders the tools they need to be proficient at these programming languages.",
            "stars": 3.5,
            "reviews": 20,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956acd",
            "title": "HTML & CSS QuickStart Guide",
            "authors": ["David DuRocher"],
            "publisher": "ClydeBank Media LLC ",
            "publishedDate": "2021-01-25",
            "description": "Master HTML and CSS fundamentals to create beautiful websites. The best book on the market for modern web design fundamentals! Every one of the over 4 billion webpages online today use HTML markup language to display its content. HTML is everywhere. Experienced developers know that a mastery of HTML and CSS fundamentals is not only an essential web design skill, but also the solid foundation of a robust coding skillset. In HTML & CSS QuickStart Guide author, instructor, and 10+ year Fortune 500 tech company veteran David DuRocher breaks down HTML5 and CSS3 fundamentals manageable, practical, and engaging segments designed for first-time developers. David’s unique and engaging approach to teaching HTML and CSS principles means that readers are ready to start designing from the very first chapter without enduring an avalanche of boring jargon or dry technobabble. Use the enclosed bonus digital asset access to go beyond the book with your own hands-on project, GitHub code repository, online tools, resources, and more! No matter whether you are a student, jobseeker looking to improve your resume, freelancer, designer, experienced developer, or just someone who wants to create their own website from scratch, everything you need to know is right here in this book! Truly anyone, at any stage of their lives, can learn to code. HTML and CSS are the perfect starting point on that journey—easy to learn, easy to implement, HTML & CSS open the door to a world of coding possibilities. HTML & CSS QuickStart Guide Is Perfect For: - Full stack developers looking to brush up on their front-end development skills - Jobseekers looking to increase the value of their resume - Artists, bloggers, and digital entrepreneurs who want to customize their web presence - WordPress, Shopify, and Squarespace users who want to tweak templates and make them their own - Anyone who wants to create attractive, responsive, and modern websites with no prior experience needed HTML & CSS QuickStart Guide Covers: - HTML and CSS for Beginners – all of the core HTML and CSS fundamentals you need to know in one place - HTML tags, CSS elements, CSS styling, and exactly how to fit the pieces together - Futureproofing – how to design sites that look great on any browser, any device - How to save time using best practices to produce clean and tidy code - Formatting, sizing, fonts, images, multimedia, forms, sprites, and gradients – all of the tools you need to make your website 100% your own! HTML and CSS QuickStart Guide Will Teach You: - Modern Web Design Fundamentals – How to use the powerful combination of HTML5 and CSS3 to build functional and responsive web pages - Site Structure and Responsive Design Principles – How to format HTML and CSS markup to produce attractive web sites and web pages that look great on any browser and any device. - Breathing Life Into Your Projects – How to incorporate forms, multimedia elements, special characters and more into your web projects - Correct Markup Best Practices – How to efficiently use CSS and HTML together to produce clean, professional HTML documents using industry-standard tools such as GitHub - HTML and CSS for Beginners – HTML and CSS elements, formatting, padding, gradients, menus, testing, debugging, keeping your site’s code up to date and more—all supported with abundant visual examples and a practical hands-on project! *LIFETIME ACCESS TO FREE HTML AND CSS DIGITAL ASSETS* - A complete hands-on project using an industry-standard GitHub code repository along with a complete online HTML, CSS, and web design resource library, web development cheat sheets, and more!",
            "isbn": "9781636100029",
            "pageCount": 361,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=BfMWEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 8.26,
            "snippet": "No matter whether you are a student, jobseeker looking to improve your resume, freelancer, designer, experienced developer, or just someone who wants to create their own website from scratch, everything you need to know is right here in ...",
            "stars": 3.5,
            "reviews": 13,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ace",
            "title": "Web Design with HTML, CSS, JavaScript and jQuery Set",
            "authors": ["Jon Duckett"],
            "publisher": "Wiley",
            "publishedDate": "2014-07-08",
            "description": "A two-book set for web designers and front-end developers This two-book set combines the titles HTML & CSS: Designing and Building Web Sites and JavaScript & jQuery: Interactive Front-End Development. Together these two books form an ideal platform for anyone who wants to master HTML and CSS before stepping up to JavaScript and jQuery. HTML & CSS covers structure, text, links, images, tables, forms, useful options, adding style with CSS, fonts, colors, thinking in boxes, styling lists and tables, layouts, grids, and even SEO, Google analytics, ftp, and HTML5. JavaScript & jQuery offers an excellent combined introduction to these two technologies using a clear and simple visual approach using diagrams, infographics, and photographs. A handy two-book set that uniquely combines related technologies Highly visual format and accessible language makes these books highly effective learning tools Perfect for beginning web designers and front-end developers",
            "isbn": "1118907442",
            "pageCount": 1152,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=zb9EnwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 46.99,
            "snippet": "A handy two-book set that uniquely combines related technologies Highly visual format and accessible language makes these books highly effective learning tools Perfect for beginning web designers and front-end developers",
            "stars": 1.5,
            "reviews": 1,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab3",
            "title": "Playing Harry Potter",
            "authors": ["Lisa S. Brenner"],
            "publisher": "McFarland",
            "publishedDate": "2015-06-11",
            "description": "Through classroom activities, wizard rock concerts, and organizations like the Harry Potter Alliance, Harry Potter fans are using creativity to positively impact the world. This collection of essays and interviews examines how playful fandom--from fanfiction to Muggle quidditch, cosplay, role-playing games, and even Harry Potter burlesque--not only reimagines the canon but also challenges consumerism, questions notions of identity, and fosters participatory culture. The contributors explore issues applicable to fan studies and performance studies at large, such as the role of performance, the nature of community, and questions of representation and ownership in the digital age. Presented in three parts, the essays discuss discrepancies between sanctioned versions of Harry Potter and fan creations, the reenactment and reinterpretation of the original narrative in fan performance, and collaborative and participatory performances that break down the boundaries between actors and audiences.",
            "isbn": "9780786496570",
            "pageCount": 238,
            "categories": ["Literary Criticism"],
            "imageUrl": "http://books.google.com/books/content?id=LbnwCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 22.99,
            "snippet": "This collection of essays and interviews examines how playful fandom--from fanfiction to Muggle quidditch, cosplay, role-playing games, and even Harry Potter burlesque--not only reimagines the canon but also challenges consumerism, ...",
            "stars": 1.5,
            "reviews": 26,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab6",
            "title": "The Psychology of Harry Potter",
            "authors": ["Neil Mulholland"],
            "publisher": "BenBella Books",
            "publishedDate": "2007-04-10",
            "description": "Harry Potter has provided a portal to the wizarding world for millions of readers, but an examination of Harry, his friends and his enemies will take us on yet another journey: through the psyche of the Muggle (and wizard!) mind. The twists and turns of the series, as well as the psychological depth and complexity of J. K. Rowling’s characters, have kept fans enthralled with and puzzling over the many mysteries that permeate Hogwarts and beyond: • Do the Harry Potter books encourage disobedience? • Why is everyone so fascinated by Professor Lupin? • What exactly will Harry and his friends do when they finally pass those N.E.W.T.s? • Do even wizards live by the ticking of the clock? • Is Harry destined to end up alone? And why did it take Ron and Hermione so long to get together? Now, in The Psychology of Harry Potter, leading psychologists delve into the ultimate Chamber of Secrets, analyzing human mind and motivation by examining the themes and characters that make the Harry Potter books the bestselling fantasy series of all time. Grab a spot on the nearest couch, and settle in for some fresh revelations about our favorite young wizard!",
            "isbn": "9781932100884",
            "pageCount": 326,
            "categories": ["Literary Criticism"],
            "imageUrl": "http://books.google.com/books/content?id=L18VBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 48.99,
            "snippet": "Now, in The Psychology of Harry Potter, leading psychologists delve into the ultimate Chamber of Secrets, analyzing human mind and motivation by examining the themes and characters that make the Harry Potter books the bestselling fantasy ...",
            "stars": 5,
            "reviews": 32,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ab8",
            "title": "Harry Potter: The Creature Vault",
            "authors": ["Jody Revenson"],
            "publisher": "Harper Design",
            "publishedDate": "2014-10-28",
            "description": "Dementors and House-elves, merpeople and Chinese Fireball Dragons—these are just a few of the magical creatures and frightening monsters populating J. K. Rowling's wizarding world. Harry Potter: The Creature Vault is a fascinating look at how this menagerie was brought to life for the blockbuster Harry Potter film series. Detailed profiles of each creature include rare concept illustrations, behind-the-scenes photography, and filmmaking secrets from the Warner Bros. archive. A removable poster picturing each of the creatures and an interactive Eeylops Owl Emporium catalog complete this must-have package.",
            "isbn": "0062374230",
            "pageCount": 208,
            "categories": ["Performing Arts"],
            "imageUrl": "http://books.google.com/books/content?id=_S-joAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
            "price": 45.99,
            "snippet": "Harry Potter: The Creature Vault is a fascinating look at how this menagerie was brought to life for the blockbuster Harry Potter film series.",
            "stars": 3.5,
            "reviews": 1,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956abd",
            "title": "JavaScript and JQuery",
            "authors": ["Jon Duckett"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2014-07-21",
            "description": "This book covers: 1. Basic programming concepts - assuming no prior knowledge of programming beyond an ability to create a web page using HTML & CSS ; 2. Core elements of the JavaScript language - so you can learn how to write your own scripts from scratch ; 3. jQuery - which will allow you to simplify the process of writing scripts (this is introduced half-way through the book once you have a solid understanding of JavaScript) ; 4. How to recreate techniques you will have seen on other web sites such as sliders, content filters, form validation, updating content using Ajax, and more. Each chapter: Breaks subjects down into bite-sized chunks with a new topic on each page ; Contains clear descriptions of syntax, each one demonstrated with inspiring code samples ; Uses diagrams and photography to explain complex concepts in a visual way. This book enables you to use & customize thousands of scripts, JavaScript APIs, and jQuery plugins that are freely available on the web as well as create your own scripts from scratch.",
            "isbn": "9781118871652",
            "pageCount": 640,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=_uTRAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 38.99,
            "snippet": "Duckett speaks directly to readers, making this an invaluable resource. This book is also available as a set, Web Design with HTML, CSS, JavaScript and jQuery Set 978119038634 along with HTML and CSS Design and Build Websites 9781118871645.",
            "stars": 1,
            "reviews": 7,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac1",
            "title": "Beginning JavaScript",
            "authors": ["Jeremy McPeak"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2015-03-09",
            "description": "The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book. Learn JavaScript using the most up to date coding style Understand JSON, functions, events, and feature detection Utilize the new HTML5 elements and the related API Explore new features including geolocation, local storage, and more JavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide.",
            "isbn": "9781118903339",
            "pageCount": 768,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=nfiRBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 28.99,
            "snippet": "The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective ...",
            "stars": 0,
            "reviews": 13,
            "__v": 0
        },
        {
            "_id": "62fb6512e40325c31d956ac2",
            "title": "Professional JavaScript for Web Developers",
            "authors": ["Matt Frisbie"],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2019-10-15",
            "description": "Update your skill set for ES 6 and 7 with the ultimate JavaScript guide for pros Professional JavaScript for Web Developers is the essential guide to next-level JavaScript development. Written for intermediate-to-advanced programmers, this book jumps right into the technical details to help you clean up your code and become a more sophisticated JavaScript developer. From JavaScript-specific object-oriented programming and inheritance, to combining JavaScript with HTML and other markup languages, expert instruction walks you through the fundamentals and beyond. This new fourth edition has been updated to cover ECMAScript 6 and 7 (also known as ES2015 and ES2016) and the major re-imagination and departure from ES 5.1; new frameworks and libraries, new techniques, new testing tools, and more are explained in detail for the professional developer, with a practical focus that helps you put your new skills to work on real-world projects. The latest—and most dramatic—ES release is already being incorporated into JavaScript engines in major browsers; this, coupled with the rise in mobile web traffic increasing demand for responsive, dynamic web design, means that all web developers need to update their skills—and this book is your ideal resource for quick, relevant guidance. Get up to date with ECMAScript 6 and 7, new frameworks, and new libraries Delve into web animation, emerging APIs, and build systems Test more effectively with mocks, unit tests, functional tests, and other tools Plan your builds for future ES releases Even if you think you know JavaScript, new ES releases bring big changes that will affect the way you work. For a professional-level update that doesn't waste time on coding fundamentals, Professional JavaScript for Web Developers is the ultimate resource to bring you up to speed.",
            "isbn": "9781119366447",
            "pageCount": 1200,
            "categories": ["Computers"],
            "imageUrl": "http://books.google.com/books/content?id=3GOuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": 41.99,
            "snippet": "Written for intermediate-to-advanced programmers, this book jumps right into the technical details to help you clean up your code and become a more sophisticated JavaScript developer.",
            "stars": 4.5,
            "reviews": 33,
            "__v": 0
        }
    ],
    "items": 45
}
